kushuninan-git/stm32f103zet6RTOS/FreeTROS/FreeRTOSConfig.h
/*
 * FreeRTOS Kernel V10.2.1
 * Copyright (C) 2019 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://www.FreeRTOS.org
 * http://aws.amazon.com/freertos
 *
 * 1 tab == 4 spaces!
 */

#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

#include "stm32f10x.h" 
/* ?????????? */ 
#define configUSE_TIME_SLICING 1 									//???????(??????) 
#define configUSE_PORT_OPTIMISED_TASK_SELECTION 1 //?????????,???
																									//???, MCU ????????????????? 0 
#define configUSE_TICKLESS_IDLE 0 							 //? 1:????? tickless ??;? 0:
																								 //??????(tick)?????? 
 
#define configUSE_QUEUE_SETS 1 					//???? 
#define configUSE_TASK_NOTIFICATIONS 1 	//????????,???? 
#define configUSE_MUTEXES 1 						//??????? 
#define configUSE_RECURSIVE_MUTEXES 1 	//????????? 
#define configUSE_COUNTING_SEMAPHORES 1 //? 1 ???????? 
#define configQUEUE_REGISTRY_SIZE 10 		//????????????????? 
#define configUSE_APPLICATION_TASK_TAG 0 
 
#define configSUPPORT_DYNAMIC_ALLOCATION 1 //???????? 
 
#define configUSE_MALLOC_FAILED_HOOK   0    //???????????? 
#define configCHECK_FOR_STACK_OVERFLOW 1	// ?? 0 ???????????,
																					//??????????????????????
																					//??????????? 1 ?? 2,?
																					//??????????? 
 
#define configGENERATE_RUN_TIME_STATS 0  //?????????? 
#define configUSE_STATS_FORMATTING_FUNCTIONS 1 
 
#define configUSE_TIMERS                       1 //??????? 
#define configTIMER_TASK_PRIORITY (configMAX_PRIORITIES-1) //???????? 
#define configTIMER_QUEUE_LENGTH 10 //????????? 
#define configTIMER_TASK_STACK_DEPTH (configMINIMAL_STACK_SIZE*2) //????
                                                                   //??????? 
 
//???????? 
#define INCLUDE_xTaskGetSchedulerState 1 
#define INCLUDE_eTaskGetState 1 
#define INCLUDE_xTimerPendFunctionCall 1 
 
 
//?????? ????????? 
#define vPortSVCHandler 				SVC_Handler 
#define xPortPendSVHandler 			PendSV_Handler 
#define xPortSysTickHandler 		SysTick_Handler 
 
/*???????? ????*/ 
#define configUSE_PREEMPTION 1 	//? 1: RTOS ????????;? 0:RTOS ????????(???) 
#define configUSE_IDLE_HOOK 0 	//? 1:??????(Idle Hook ???????);? 0:?????? 
#define configUSE_TICK_HOOK 0 	//? 1:???????(Tick Hook);? 0:??????? 
#define configCPU_CLOCK_HZ ( ( unsigned long ) 72000000 ) // ???? 
																													//CPU ??????,??? CPU ?????? 
#define configTICK_RATE_HZ ( ( TickType_t ) 1000 ) //RTOS??????????????????,???? RTOS ???????? 
#define configMAX_PRIORITIES ( 5 ) 									//????????? 
#define configMINIMAL_STACK_SIZE ( ( unsigned short ) 128 ) //??????????? 
#define configTOTAL_HEAP_SIZE ( ( size_t ) ( 17 * 1024 ) ) //????????? 

#define configMAX_TASK_NAME_LEN ( 16 ) //????????? 
#define configUSE_TRACE_FACILITY 0 		//????????? 
#define configUSE_16_BIT_TICKS 0 	//?????????????, 1 ??? 
																	//16 ??????, 0 ??? 32 ?????? 
#define configIDLE_SHOULD_YIELD 1 //?????? CPU ??????????????? 
 
 
 
/* Co-routine definitions. */ 
#define configUSE_CO_ROUTINES 0 //????,???????????? croutine.c 
#define configMAX_CO_ROUTINE_PRIORITIES ( 2 ) //?????????? 
 
/* Set the following definitions to 1 to include the API function, or zero 
to exclude the API function. */ 
 
#define INCLUDE_vTaskPrioritySet 1 
#define INCLUDE_uxTaskPriorityGet 1 
#define INCLUDE_vTaskDelete 1 
#define INCLUDE_vTaskCleanUpResources 1 
#define INCLUDE_vTaskSuspend 1 
#define INCLUDE_vTaskDelayUntil 1 
#define INCLUDE_vTaskDelay 1 
 
/* This is the raw value as per the Cortex-M3 NVIC. Values can be 255 
(lowest) to 0 (1?) (highest). */ 
#define configKERNEL_INTERRUPT_PRIORITY 255 
/* !!!! configMAX_SYSCALL_INTERRUPT_PRIORITY must not be set to zero !!!! 
See http://www.FreeRTOS.org/RTOS-Cortex-M3-M4.html. */ 
#define configMAX_SYSCALL_INTERRUPT_PRIORITY 191 /* equivalent to 0xb0, or priority 
11. */ 
 
 
/* This is the value being used as per the ST library which permits 16 
priority values, 0 to 15. This must correspond to the 
configKERNEL_INTERRUPT_PRIORITY setting. Here 15 corresponds to the lowest 
NVIC value of 255. */ 
#define configLIBRARY_KERNEL_INTERRUPT_PRIORITY 15 //??????
#endif /* FREERTOS_CONFIG_H */